flix 2/app/controllers/reviews_controller.rb

  def index
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def create
  @movie = Movie.find(params[:movie_id])
  @review = @movie.reviews.new(review_params)
  if @review.save
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Was OK"], ["created_at", "2016-03-29 08:51:13.654333"], ["movie_id", 6], ["name", "noggin"], ["stars", 2], ["updated_at", "2016-03-29 08:51:13.654333"]]