flix/app/controllers/movies_controller.rb

  def index
  @movies = Movie.all
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-05-02 07:48:56.913097')  ORDER BY released_on desc