flix/app/controllers/reviews_controller.rb

  def index
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]