flix/app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, 'Movie') %></h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-05-02 07:48:56.913097')  ORDER BY released_on desc